/**مع التقدم التكنولوجي، والانتشار الكبير لعالم الإنترنت ومواقع التواصل الاجتماعي، أصبح تعلم استعمال الحاسوب ضرورة لا يمكن الاستغناء عنها في جميع أقطار العالم، وهو ما يترتب عليه ضرورة تعلم استخدام ملحقات الحاسوب كالفأرة ولوحة المفاتيح. استخدام الفأرة سهل ولا يتطلب مهارة خاصة، لكن على العكس تماما تتطلب لوحة المفاتيح تعلما وتدريبا خاصا لإتقان الكتابة عليها، وذلك لما تحتويه من المفاتيح من جهة، ولضرورة التمرن على الطباعة بشكل أسرع من جهة أخرى. ولعل البعض يتساءل عن أهمية التمرن على الكتابة باللمس والفائدة من ذلك، والجواب هنا هو أن الكثير من الأفراد بحاجة ماسة لهذه المهارة نظرا لأن طبيعة عملهم تتطلب السرعة في الكتابة على لوحة المفاتيح مثل المحررين الصحفيين، أو المدونين، أو الكتاب وغيرهم. كما أنها تعد عاملا أساسيا في عملية إدخال المعلومات والنصوص والرسائل دون الحاجة إلى النظر بشكل مستمر في لوحة المفاتيح، وبالتالي اختصار الوقت والجهد. على هذا الأساس، ظهرت بعض المواقع العربية التي تهدف إلى تمكين المستخدمين من فن الطباعة باللمس، ولعل أبرز المواقع العربية التي تقدم هذه الخدمة هي موقع أكاديمية الطباعة، نظرا لكونه الموقع الأول من نوعه لتعليم طباعة اللغة العربية باللمس بطريقة بسيطة وعصرية. ولهذا فقد قررنا في هذا الموضوع التعريف بموقع أكاديمية الطباعة وشرح خصائصه ومميزاته وأهدافه. موقع أكاديمية الطباعة هو موقع عربي متخصص في مجال تعليم مستخدمي الإنترنت العرب فن الطباعة باللمس. فنظرا لقلة وضعف المواقع العربية في هذا المجال، كانت هناك حاجة ماسة لإنشاء موقع جديد يواكب العصر، ويقدم خدمة تعليم الكتابة باللمس مجانا بما يرقى لتطلعات المستخدمين, يجمع الموقع بين تقديم الفائدة والمتعة للراغبين بالتعلم في آن واحد، وبالتالي تصبح النتيجة تغلب المستخدم العربي على مشكلة البطء في الكتابة، فيحظى بفرصة العمل على حاسوبه بسرعة وسهولة. بالإضافة إلى تصميمه السلس، فإن موقع أكاديمية الطباعة يتميز أيضا باحتوائه على لوحة مفاتيح تعليمية لتساعدك على تعلم الطريقة الصحيحة للكتابة باللمس. كذلك يوفر الموقع لمستخدميه دروس منظمة للطباعة تبدأ مع المستخدم من الصفر وحتى الاحتراف. أما بالنسبة للاختبارات التي يخضع لها المستخدم فإن الموقع يحرص على انتقاء المحتوى الخاص بها بعناية كبيرة، وذلك بهدف تعزيز معلومات المستخدمين في مختلف المجالات. أما عن طريقة عمل موقع أكاديمية الطباعة فهي سهلة وبسيطة كسهولة تصميمه، فاختبارات الموقع تنقسم إلى ثلاث مستويات حسب توقيت كل اختبار. هناك اختبارات مدتها دقيقة، وهناك اختبارات مدتها ثلاث دقائق، وهناك اختبارات مدتها 5 دقائق، وهذا لإظهار القدرات الحقيقية في الكتابة لكل مستخدم حسب مستواه. يقوم الموقع بعد الاختبارات بعرض احصائيات دقيقة تساعد المستخدم على معرفة مواطن الضعف لديه من جهة، كما تظهر له مدى تحسن مستواه من جهة أخرى. ويعرض الموقع في الأخير قائمة لأفضل المختبرين في الموقع من حيث النتائج بهدف تعزيز روح المنافسة بين المستخدمين وتحفيزهم على التحسن بشكل أكبر. مما سبق نستنتج أن موقع أكاديمية الطباعة يهدف أساسا إلى تمكين مستخدميه من مهارات وفن الطباعة باللمس بشكل عام، والتخلص من مشكلة البطء أثناء الكتابة بشكل خاص. ويهدف أيضا إلى تعزيز معلومات المستخدمين، وتحفيزهم على التحسن والرغبة في المنافسة مع الحرص الشديد على ضمان راحة المستخدم */

// Tybaa hack script/////////////////////////////////////
let message = `مع التقدم التكنولوجي، والانتشار الكبير لعالم الإنترنت ومواقع التواصل الاجتماعي، أصبح تعلم استعمال الحاسوب ضرورة لا يمكن الاستغناء عنها في جميع أقطار العالم، وهو ما يترتب عليه ضرورة تعلم استخدام ملحقات الحاسوب كالفأرة ولوحة المفاتيح. استخدام الفأرة سهل ولا يتطلب مهارة خاصة، لكن على العكس تماما تتطلب لوحة المفاتيح تعلما وتدريبا خاصا لإتقان الكتابة عليها، وذلك لما تحتويه من المفاتيح من جهة، ولضرورة التمرن على الطباعة بشكل أسرع من جهة أخرى. ولعل البعض يتساءل عن أهمية التمرن على الكتابة باللمس والفائدة من ذلك، والجواب هنا هو أن الكثير من الأفراد بحاجة ماسة لهذه المهارة نظرا لأن طبيعة عملهم تتطلب السرعة في الكتابة على لوحة المفاتيح مثل المحررين الصحفيين، أو المدونين، أو الكتاب وغيرهم. كما أنها تعد عاملا أساسيا في عملية إدخال المعلومات والنصوص والرسائل دون الحاجة إلى النظر بشكل مستمر في لوحة المفاتيح، وبالتالي اختصار الوقت والجهد. على`;
let test2 = document.body
async function hello3() {
    for (let i = 0; i < message.length; i++) {
        let eventr = new KeyboardEvent('keypress', {
            view: window,
            key: message[i],
            bubbles: true,
            cancelable: true,
            charCode: message[i].charCodeAt(0),
        })
        test2.dispatchEvent(eventr);
    }
}
test2.addEventListener('click', function () {
    setTimeout(() => {
        hello3();
    }, 2000);
})
// End Tybaa hack script/////////////////////////////////////


// Key hero hack script/////////////////////////////////////////
let input = document.querySelector('[data-reactid=".0.0.1.0.0"]');
let word = document.querySelector('[data-reactid=".0.0.0.1.2"]');
let Stop = document.querySelector('[data-reactid=".0.0.0.1.4"]');
let stopCount = 0;
async function dispatch() {
    wordChars = word.innerHTML;
    _stop = Stop.innerHTML;
    if (_stop == '')
        return;
    for (let i = 0; i < wordChars.length; i++) {
        let event = new KeyboardEvent('keypress', {
            view: window,
            key: wordChars[i],
            bubbles: true,
            cancelable: true,
            charCode: wordChars[i].charCodeAt(0),
        })
        input.dispatchEvent(event)
    }
    dispatch();
}

input.addEventListener('click', function () {
    setTimeout(() => {
        dispatch();
    }, 2000);
})


input.addEventListener('keypress', e => {
    input.value += e.key
})

// if (_stop == '' && stopCount == 1)
//     return
// else if (_stop == '') {
//     stopCount = 1
//     dispatch();
// } else
//     dispatch();



// End Key hero hack script//////////////////////////////////////



// Play type racer hack script/////////////////////////////////////////
let text;
document.documentElement.addEventListener('click', () => {
    divList = document.getElementsByTagName('table')
    text = divList[12].querySelector('td').querySelector('div').querySelector('div').innerText
})
input = document.getElementsByTagName('input')[0]
input.addEventListener('click', async function () {
    for (let i = 0; i < text.length - 2; i++) {
        let event = new KeyboardEvent('keypress', {
            view: window,
            key: text[i],
            bubbles: true,
            cancelable: true,
            charCode: text[i].charCodeAt(0),
        })
        await setTimeout(() => {
            input.dispatchEvent(event)
        }, 500);
    }
})

input.addEventListener('keypress', e => {
    input.value += e.key
})


// End play type racer hack script//////////////////////////////////////